In [2]:
import numpy as np
import pandas as pd
from numpy.random import randn
np.random.seed(101) ## Seed means that every one will get same random numbers, so that we can match course data

In [5]:
df = pd.DataFrame(data = randn(5,4), index=["A", "B", "C", "D", "E"], columns=["W", "X", "Y", "Z"])

In [6]:
df
## see a dataframe is bunch of series we read earlier. all the W,X,Y,Z have A,B,C,D as keys

          W         X         Y         Z
A  0.302665  1.693723 -1.706086 -1.159119
B -0.134841  0.390528  0.166905  0.184502
C  0.807706  0.072960  0.638787  0.329646
D -0.497104 -0.754070 -0.943406  0.484752
E -0.116773  1.901755  0.238127  1.996652

In [7]:
df["W"] ## see how it is printed as a sereis.

A    0.302665
B   -0.134841
C    0.807706
D   -0.497104
E   -0.116773
Name: W, dtype: float64

In [9]:
df["Z"]

A   -1.159119
B    0.184502
C    0.329646
D    0.484752
E    1.996652
Name: Z, dtype: float64

In [16]:
## checking type 
type(df["Z"])

pandas.core.series.Series

In [15]:
type(df)

pandas.core.frame.DataFrame

In [18]:
df[["W", "Z"]] ## A dataframe with two series

          W         Z
A  0.302665 -1.159119
B -0.134841  0.184502
C  0.807706  0.329646
D -0.497104  0.484752
E -0.116773  1.996652

In [20]:
## Creating a new column
df["new_col"] = df["W"] + df["Z"]
df

          W         X         Y         Z   new_col
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [21]:
df["dropable_col"] = df["W"] * 100  ## Adding a new column just to test delete col
df

          W         X         Y         Z   new_col  dropable_col
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454     30.266545
B -0.134841  0.390528  0.166905  0.184502  0.049661    -13.484072
C  0.807706  0.072960  0.638787  0.329646  1.137352     80.770591
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352    -49.710402
E -0.116773  1.901755  0.238127  1.996652  1.879879    -11.677332

In [26]:
## Droping a column
# df.drop("dropable_col")  ## only writing this gives error ((KeyError: "['dropable_col'] not found in axis")) 
## by default axis is 0 which means the rows . So we have to mention columns by giving axis as 1

df.drop("dropable_col", axis=1)

          W         X         Y         Z   new_col
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [27]:
df ## See how the original table still has the dropable_col

          W         X         Y         Z   new_col  dropable_col
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454     30.266545
B -0.134841  0.390528  0.166905  0.184502  0.049661    -13.484072
C  0.807706  0.072960  0.638787  0.329646  1.137352     80.770591
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352    -49.710402
E -0.116773  1.901755  0.238127  1.996652  1.879879    -11.677332

In [28]:
## we need to specify (inplace=True). This is a security measure of pandas such that we dont accidently loose our data.
df.drop("dropable_col", axis =1, inplace=True)

In [29]:
df

          W         X         Y         Z   new_col
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [30]:
## Removing row
df.drop("E", axis=0)

          W         X         Y         Z   new_col
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352

In [31]:
##ROWS
df

          W         X         Y         Z   new_col
A  0.302665  1.693723 -1.706086 -1.159119 -0.856454
B -0.134841  0.390528  0.166905  0.184502  0.049661
C  0.807706  0.072960  0.638787  0.329646  1.137352
D -0.497104 -0.754070 -0.943406  0.484752 -0.012352
E -0.116773  1.901755  0.238127  1.996652  1.879879

In [32]:
## SELECTING A ROW IN PANDAS   (Label based index)
df.loc["A"]  ## Check the result. It is also in the form of a series. Hence its final that both rows and columns are in the form of series.

W          0.302665
X          1.693723
Y         -1.706086
Z         -1.159119
new_col   -0.856454
Name: A, dtype: float64

In [33]:
## selecting Rows as Indexed based location 0, 1, 2, 3 ....
df.iloc[2]

W          0.807706
X          0.072960
Y          0.638787
Z          0.329646
new_col    1.137352
Name: C, dtype: float64

In [35]:
## Accessing a specific place 
df.loc['B', "Y"]

0.16690463609281317

In [36]:
## Getting subsets from a dataframe
df.loc[['A', 'C'], ['Y', 'Z']]

          Y         Z
A -1.706086 -1.159119
C  0.638787  0.329646